rules_stacking = [
    {
        "id": "178865711719762093963625477303475114274",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "23552730282924907797276479617165693218"
        ],
        "rule": " - 在建立团购联合立减时可以配置是否与平台券叠加\n - 不需要考虑其他优惠活动",
        "type": "stacking",
        "is_marked": False,
        "short_name": "在建立团购联合立减时​可以配置是否与平台券叠加",
        "edit_date": "2023-08-09T14:29:04Z",
        "is_deleted": False
    },
    {
        "id": "259471917873730239956004281200178610032",
        "entity_id_list": [
            "23552730282924907797276479617165693218",
            "41173756740046565659932171290170888482"
        ],
        "rule": "- 评价券和团购联合立减两个活动可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "[评估]评价券和团购联合立减两个活动可以叠加",
        "edit_date": "2023-08-09T14:27:25Z",
        "is_deleted": False
    },
    {
        "id": "222126644384822559616285410190734397730",
        "entity_id_list": [
            "181900698758755421065244484107724636016",
            "23664117948885337172142618992382578978"
        ],
        "rule": " - 平台立减和平台闲时立减​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和平台闲时立减​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T20:21:44Z",
        "is_deleted": False
    },
    {
        "id": "203212776900389658228783449346920157474",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "96091799269957557616035342769278947618"
        ],
        "rule": "平台立减可以配置与平台券互斥，平台券可以配置与平台立减互斥。当其中一方设置了互斥时，二者无法同时使用，默认使用优惠金额更大的优惠。",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和平台券​平台立减可以配置与平台券互斥，平台券可以配置与平台立减互斥。当其中一方设置了互斥时，二者无法同时使用，默认使用优惠金额更大的优惠。",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "182376127154962892789058942967703388016",
        "entity_id_list": [
            "181900698758755421065244484107724636016",
            "96091799269957557616035342769278947618"
        ],
        "rule": " - 平台闲时立减和平台券两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": " - 平台闲时立减和平台券两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "146445183965098580505749758803389190434",
        "entity_id_list": [
            "23552730282924907797276479617165693218",
            "96177165238221802011862258569447477538"
        ],
        "rule": " - 在建立团购联合立减时可以配置是否与商家立减叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "在建立团购联合立减时​可以配置是否与商家立减叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "137327721903792686218774231637450297634",
        "entity_id_list": [
            "23552730282924907797276479617165693218",
            "96257619852691787161401750580134678818"
        ],
        "rule": " - 在建立团购联合立减时可以配置是否与商家券叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "在建立团购联合立减时​可以配置是否与商家券叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "107376481329181472934685333070251299106",
        "entity_id_list": [
            "181900698758755421065244484107724636016",
            "23664117948885337172142618992382578978"
        ],
        "rule": " - 平台闲时立减和平台立减无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台闲时立减和平台立减无法叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "174925818955748507212889221950683725680",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "229964548799439596056985469075639505186"
        ],
        "rule": "- 平台立减和会员卡折扣两个活动可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和会员卡可叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "335286548157518142970909324331897065762",
        "entity_id_list": [
            "23552730282924907797276479617165693218",
            "23664117948885337172142618992382578978"
        ],
        "rule": " - 团购联合立减和平台立减两个活动无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "团购联合立减和平台立减两个活动无法叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "88999542471042418494536819608645538082",
        "entity_id_list": [
            "96177165238221802011862258569447477538",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 商家立减和医美会员折上折能够相互叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家立减和医美会员折上折能够相互叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "286542308364131778637126680695764160802",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "96091799269957557616035342769278947618",
            "96177165238221802011862258569447477538"
        ],
        "rule": "  - 平台券、平台立减、商家立减三个活动可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券、平台立减、商家立减三个活动可以叠加",
        "edit_date": "2023-08-08T19:58:38Z",
        "is_deleted": False
    },
    {
        "id": "222559487643678614258643339177407549730",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 平台立减和返礼​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和返礼​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False,
        "expect": {
            'search': [r'叠加生效'],
            'length': 1
        }
    },
    {
        "id": "222967717881567987541884457800469319970",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "96257619852691787161401750580134678818"
        ],
        "rule": " - 平台券和商家券​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和商家券​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False,
        "expect": {
            'search': [r'叠加生效'],
            'length': 1
        }
    },
    {
        "id": "222033893559530360641551400158955049250",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "96177165238221802011862258569447477538"
        ],
        "rule": "在建立平台立减时可以配置平台立减是否与商家立减叠加。",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和商家立减在建立平台立减时可以配置平台立减是否与商家立减叠加。",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False,
        "expect": {
            'search': [r'可以同时生效', r'只能生效商家立减', r'只能生效平台立减'],
            'length': 3
        }
    },
    {
        "id": "223057554695042911874281777285755310370",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "229964548799439596056985469075639505186"
        ],
        "rule": " - 平台券和会员卡折扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和会员卡折扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "223148092677756087446066799635001774370",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "254348411813427947289027018035948425506"
        ],
        "rule": " - 平台券和会员日折扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和会员日折扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "223241490797136027960438948920855367970",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "17092456567440036340268041367394980130"
        ],
        "rule": " - 平台券和积分抵扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和积分抵扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "223331916275858433276864588437692354850",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 平台券和返礼​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和返礼​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "223674692959568272220246176661623542050",
        "entity_id_list": [
            "96177165238221802011862258569447477538",
            "96257619852691787161401750580134678818"
        ],
        "rule": "商家立减可以配置与商家券互斥，商家券可以配置与商家立减互斥。当其中一方设置了互斥时，二者无法同时使用，默认使用优惠金额更大的优惠。",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家立减和商家券​商家立减可以配置与商家券互斥，商家券可以配置与商家立减互斥。当其中一方设置了互斥时，二者无法同时使用，默认使用优惠金额更大的优惠。",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "223766428079817038326172237459959583010",
        "entity_id_list": [
            "96177165238221802011862258569447477538",
            "229964548799439596056985469075639505186"
        ],
        "rule": "可以在建立会员卡折扣时配置是否与商家立减同享",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家立减和会员卡折扣可以在建立会员卡折扣时配置是否与商家立减同享",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "223424701961542138527907139628809851170",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 平台券和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "223580668145422843874963662443122790690",
        "entity_id_list": [
            "96177165238221802011862258569447477538",
            "16982863419360555052648395762653204770"
        ],
        "rule": " - 商家立减和闲时立减​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家立减和闲时立减​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "222223184693127815854286519429658317090",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "96257619852691787161401750580134678818"
        ],
        "rule": "在建立平台立减时可以配置平台立减是否与商家券叠加。",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和商家券在建立平台立减时可以配置平台立减是否与商家券叠加。",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "222350321333232830694179503471322992930",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "254348411813427947289027018035948425506"
        ],
        "rule": " - 平台立减和会员日折扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和会员日折扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "222441666650922026619564604033423380770",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "17092456567440036340268041367394980130"
        ],
        "rule": " - 平台立减和积分抵扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和积分抵扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "222655314898521242117606106520778445090",
        "entity_id_list": [
            "23664117948885337172142618992382578978",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 平台立减和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台立减和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "222875214248142833071883739625815019810",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "16982863419360555052648395762653204770"
        ],
        "rule": " - 平台券和闲时立减​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和闲时立减​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "222786689453039144956916969228346593570",
        "entity_id_list": [
            "96091799269957557616035342769278947618",
            "96177165238221802011862258569447477538"
        ],
        "rule": " - 平台券和商家立减​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "平台券和商家立减​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:37Z",
        "is_deleted": False
    },
    {
        "id": "224067166300496808612026691263842488610",
        "entity_id_list": [
            "96177165238221802011862258569447477538",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 商家立减和返礼​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家立减和返礼​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "224479852330245984121614070798671155490",
        "entity_id_list": [
            "16982863419360555052648395762653204770",
            "254348411813427947289027018035948425506"
        ],
        "rule": " - 闲时立减和会员日折扣​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "闲时立减和会员日折扣​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "224579902446150622269770574034594959650",
        "entity_id_list": [
            "16982863419360555052648395762653204770",
            "17092456567440036340268041367394980130"
        ],
        "rule": " - 闲时立减和积分抵扣​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "闲时立减和积分抵扣​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "226147346075079826783574240064526356770",
        "entity_id_list": [
            "254348411813427947289027018035948425506",
            "17092456567440036340268041367394980130"
        ],
        "rule": " - 会员日折扣和积分抵扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "会员日折扣和积分抵扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "225781155884783772443147007732391874850",
        "entity_id_list": [
            "229964548799439596056985469075639505186",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 会员卡折扣和返礼​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "会员卡折扣和返礼​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "224761346030251039599867052777017446690",
        "entity_id_list": [
            "16982863419360555052648395762653204770",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 闲时立减和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "闲时立减和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "225349427366174293500019019909099950370",
        "entity_id_list": [
            "96257619852691787161401750580134678818",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 商家券和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家券和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "224979717068617730395072506419252039970",
        "entity_id_list": [
            "96257619852691787161401750580134678818",
            "229964548799439596056985469075639505186"
        ],
        "rule": " - 商家券和会员卡折扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家券和会员卡折扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "225070308134199790523963716442945229090",
        "entity_id_list": [
            "96257619852691787161401750580134678818",
            "254348411813427947289027018035948425506"
        ],
        "rule": " - 商家券和会员日折扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家券和会员日折扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "225160529996544534181041740551829852450",
        "entity_id_list": [
            "96257619852691787161401750580134678818",
            "17092456567440036340268041367394980130"
        ],
        "rule": " - 商家券和积分抵扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家券和积分抵扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "224669092757819430205173130201246208290",
        "entity_id_list": [
            "16982863419360555052648395762653204770",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 闲时立减和返礼​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "闲时立减和返礼​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "225253230115812724026599690715480985890",
        "entity_id_list": [
            "96257619852691787161401750580134678818",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 商家券和返礼​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家券和返礼​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "223859323892646638404644043677168046370",
        "entity_id_list": [
            "96177165238221802011862258569447477538",
            "254348411813427947289027018035948425506"
        ],
        "rule": " - 商家立减和会员日折扣​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家立减和会员日折扣​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "224389627298774739893962542948028518690",
        "entity_id_list": [
            "16982863419360555052648395762653204770",
            "229964548799439596056985469075639505186"
        ],
        "rule": " - 闲时立减和会员卡折扣​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "闲时立减和会员卡折扣​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "223972149549756701677237505875083530530",
        "entity_id_list": [
            "96177165238221802011862258569447477538",
            "17092456567440036340268041367394980130"
        ],
        "rule": " - 商家立减和积分抵扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "商家立减和积分抵扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "224296579367873112427962557126435410210",
        "entity_id_list": [
            "16982863419360555052648395762653204770",
            "96257619852691787161401750580134678818"
        ],
        "rule": " - 闲时立减和商家券​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "闲时立减和商家券​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:36Z",
        "is_deleted": False
    },
    {
        "id": "225872849806388031131617519887873741090",
        "entity_id_list": [
            "229964548799439596056985469075639505186",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 会员卡折扣和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "会员卡折扣和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "225599750330201361959932573891065549090",
        "entity_id_list": [
            "229964548799439596056985469075639505186",
            "254348411813427947289027018035948425506"
        ],
        "rule": " - 会员卡折扣和会员日折扣​两个活动的优惠无法叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "会员卡折扣和会员日折扣​两个活动的优惠无法叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "225693241938813069306223083558780539170",
        "entity_id_list": [
            "229964548799439596056985469075639505186",
            "17092456567440036340268041367394980130"
        ],
        "rule": " - 会员卡折扣和积分抵扣​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "会员卡折扣和积分抵扣​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "227119294196637692540513935119502807330",
        "entity_id_list": [
            "17128566387069162597413050893639618850",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 返礼和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "返礼和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "226330646767309578469743911477144719650",
        "entity_id_list": [
            "254348411813427947289027018035948425506",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 会员日折扣和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "会员日折扣和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "226752428190115391525287029857471959330",
        "entity_id_list": [
            "17092456567440036340268041367394980130",
            "117837601685463120084741013086071165218"
        ],
        "rule": " - 积分抵扣和医美会员折上折​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "积分抵扣和医美会员折上折​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "226239219844612992852091089564775485730",
        "entity_id_list": [
            "254348411813427947289027018035948425506",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 会员日折扣和返礼​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "会员日折扣和返礼​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "226661208845204593280198703030252605730",
        "entity_id_list": [
            "17092456567440036340268041367394980130",
            "17128566387069162597413050893639618850"
        ],
        "rule": " - 积分抵扣和返礼​两个活动的优惠可以叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "积分抵扣和返礼​两个活动的优惠可以叠加",
        "edit_date": "2023-08-08T19:58:35Z",
        "is_deleted": False
    },
    {
        "id": "78789544014594568030420507217959305072",
        "entity_id_list": [
            "23552730282924907797276479617165693218",
            "14639003608712840477684211488942723362"
        ],
        "rule": "- ​测试立减可以配置与团购联合立减互斥，团购联合立减也可以配置与测试立减互斥。\n- 不需要考虑其他优惠活动",
        "type": "stacking",
        "is_marked": False,
        "short_name": "[评估] 双向配置测试立减和团购联合立减的叠加情况",
        "is_deleted": False
    },
    {
        "id": "35685097593874968017834652114492592418",
        "entity_id_list": [
            "117837601685463120084741013086071165218",
            "14639003608712840477684211488942723362"
        ],
        "rule": " - 医美会员折上折和测试立减可以互相配置是否相互叠加",
        "type": "stacking",
        "is_marked": False,
        "short_name": "医美会员折上折和测试立减可以互相配置是否相互叠加",
        "is_deleted": False
    }
]
