Repository: pypi-data/pypi-mirror-364
Catalog: packages/djangocms-help-rating/djangocms_help_rating-1.0.1.tar.gz/djangocms_help_rating-1.0.1/help_rating/locale/*/LC_MESSAGES/django.po
Languages: cs

source: Arithmetic mean
cs: Aritmetický průměr

source: Browser fingerprint
cs: Otisk prohlížeče

source: Did this help you?
cs: Pomohla Vám tato nápověda?

source: Feedback summary
cs: Přehled hlasování

source: Feedbacks summaries
cs: Přehledy hlasování

source: Help Rating
cs: Hodnocení nápovědy

source: Last modified at
cs: Naposled změněno v

source: Median
cs: Medián

source: Not at all
cs: Vůbec

source: Number of addresses
cs: Počet adres

source: Number of votes
cs: Počet hlasů

source: On the page
cs: Na stránce

source: Partially
cs: Částečně

source: Remote address
cs: Vzdálená adresa

source: Score
cs: Hodnocení

source: Subject name
cs: Název předmětu

source: Subject of evaluation.
cs: Předmět hodnocení

source: Thank you for your feedback. It will help us improve the content of the site.
cs: Děkujeme vám za váš názor. Pomůže nám vylepšit obsah stránek.

source: User voting
cs: Hlasování uživatele

source: User votings
cs: Hlasování uživatelů

source: Vote summarization
cs: Sumarizace hlasování

source: Vote summarizations
cs: Sumarizace hlasování

source: Voting content
cs: Hlasování pro obsah

source: Yes
cs: Ano
