class ReflectionPrompt:
    SINGLE_IMAGE = '''你是一个页面分析专家，能够根据页面，分析用户的行为。
现在，我会给你一张页面截图，是用户在进行了某步操作后的截图。
此外，我还会给你用户的操作信息，这个信息包括了元素的位置定位、元素的文本信息、元素的class信息、元素截图位置等等。
注意，截图中的红色框是后期添加的，用于辅助你的理解，原始截图中并不存在红色的框，请不要用红色框描述元素
'''

    DOUBLE_IMAGE = '''你是一个页面分析专家，能够根据页面，分析用户的行为。
现在，我会给你两张页面截图，第一张是用户操作前的截图，第二张是用户操作后的截图。
此外，我还会给你用户的操作信息，这个信息包括了元素的位置定位、元素的文本信息、元素的class信息、元素截图位置等等。
注意，截图中的红色框是后期添加的，用于辅助你的理解，原始截图中并不存在红色的框，请不要用红色框描述元素
'''

    BASIC_EXPLAIN = '''{basic_desc}
你需要根据上述内容，进行如下分析：
1. 被操作对象：描述目标元素的颜色、形状、OCR或者其周围元素，相关元素。注意，这个被操作对象应该在操作前截图中存在
2. 操作：用户进行了什么操作
用简介的一句话回答，这句话的格式是用户对“被操作对象”进行了“操作”。

# 建议:
{notice}
#####

现在记录了一个新的事件:
{event}'''

    REFLECTION_NOTICE = '''{basic_desc}
## 元素描述 ##
{content}
########

并且我明确告诉你，这个定位信息，和我的预期意图不一致，请你参考以下内容，给提一些辅助定位的改进建议，我们会根据改进建议重新定位
你可以参考这些:
1. 描述要包括形状、颜色、文本内容、视觉样式等等可见的视觉信息
2. 要关注这个元素与其他元素之间的关系，请用方向和关联关系等信息进行说明
3. 要分析用户可能对这个元素进行什么样的操作
4. 严格判断当前元素的相对位置是否准确，不能出现误导的描述，不能出现方向错误的描述

包括但不仅限于上述的参考，请你提出你对这个不完善的元素描述的错误分析与改进意见，按照如下格式输出
错误分析:
改进意见:
'''

    DIFF_EXPLAIN = '''给定了2个ui截图，请你描述两张截图有哪些变化，以及用户在此期间做了什么交互，你可以类比为描述电影的过场解说
要求：
1. 描述第一张图展示了什么
2. 描述第二张图在第一张图的基础上改变了什么
3. 解释用户在此期间做了什么交互
'''
