Repository: pypi-data/pypi-mirror-364
Catalog: packages/django-hidp/django_hidp-1.6.0.tar.gz/django_hidp-1.6.0/hidp/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Keep these codes safe. These codes are the only way to log in if you lose access to your two-factor device.
nl: Bewaar deze codes veilig. Deze codes zijn de enige manier om in te loggen als je geen toegang meer hebt tot je tweefactor­apparaat.

source: These codes can be used to log in if you lose access to your two-factor device. You can generate new codes at any time, but you can only have one set of codes at a time.
nl: Deze codes kunnen worden gebruikt om in te loggen als je geen toegang meer hebt tot je tweefactor­apparaat. Je kunt op elk moment nieuwe codes genereren, maar je kunt slechts één set codes tegelijk hebben.

source: Enter the following URL in your authenticator app:
nl: Voer de volgende URL in bij je authenticator-app:

source: Having trouble scanning the QR code?
nl: Problemen met het scannen van de QR-code?

source: QR code for setting up two-factor authentication. Scan with your authenticator app.
nl: QR-code voor het instellen van tweefactor­authenticatie. Scan met je authenticator-app.

source: Scan the QR code
nl: Scan de QR-code

source: Submit
nl: Verzenden

source: Two-factor Authentication
nl: Tweefactor­authenticatie

source: Verify
nl: Verifiëren
