Repository: pypi-data/pypi-mirror-364
Catalog: packages/django-hidp/django_hidp-1.6.0.tar.gz/django_hidp-1.6.0/hidp/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Email
nl: E-mailadres

source: Enter the same password as before, for verification.
nl: Voer ter verificatie nogmaals het wachtwoord in.

source: I am not a robot
nl: Ik ben geen robot

source: I have read and accept the <a href="{url}">Terms of Service</a>
nl: Ik heb de <a href="{url}">Servicevoorwaarden</a> gelezen en accepteer ze

source: New email
nl: Nieuw e-mailadres

source: Password
nl: Wachtwoord

source: Password confirmation
nl: Wachtwoordbevestiging

source: Please confirm that you are not a robot.
nl: Bevestig dat je geen robot bent.

source: Please note that this also changes the username you use to sign in.
nl: Let op dat hiermee ook je gebruikersnaam voor het inloggen verandert.

source: The new email address is the same as the current email address.
nl: Het nieuwe e-mailadres is hetzelfde als het huidige e-mailadres.

source: The password is incorrect.
nl: Het wachtwoord is incorrect.

source: Yes, I want to cancel changing my email address
nl: Ja, ik wil het wijzigen van mijn e-mailadres annuleren

source: Yes, I want to change my email address
nl: Ja, ik wil mijn e-mailadres wijzigen

source: Your password is required to verify your identity.
nl: Je wachtwoord is nodig om je identiteit te verifiëren.

source: agreed to terms of service
nl: akkoord met de servicevoorwaarden

source: confirmed by current email
nl: bevestigd door huidig e-mailadres

source: confirmed by proposed email
nl: bevestigd door voorgesteld e-mailadres

source: created at
nl: aangemaakt op

source: current email address
nl: huidig e-mailadres

source: email address
nl: e-mailadres

source: email change request
nl: e-mailadres wijzig verzoek

source: email change requests
nl: e-mailadres wijzig verzoeken

source: email verified
nl: e-mailadres geverifieerd

source: last modified
nl: laatst gewijzigd

source: proposed email address
nl: voorgesteld e-mailadres

source: user
nl: gebruiker

source: users
nl: gebruikers

source: This password does not contain any digits (0-9).
nl: Dit wachtwoord bevat geen cijfers (0-9).

source: This password does not contain any lowercase characters (a-z).
nl: Dit wachtwoord bevat geen kleine letters (a-z).

source: This password does not contain any special characters ({}).
nl: Dit wachtwoord bevat geen speciale tekens ({}).

source: This password does not contain any uppercase characters (A-Z).
nl: Dit wachtwoord bevat geen hoofdletters (A-Z).

source: Your password must contain at least one digit (0-9).
nl: Uw wachtwoord moet minstens één cijfer bevatten (0-9).

source: Your password must contain at least one lowercase character (a-z).
nl: Uw wachtwoord moet minstens één kleine letter bevatten (a-z).

source: Your password must contain at least one special character ({}).
nl: Uw wachtwoord moet minstens één speciaal teken bevatten ({}).

source: Your password must contain at least one uppercase character (A-Z).
nl: Uw wachtwoord moet minstens één hoofdletter bevatten (A-Z).

source: Authenticate with {provider}
nl: Opnieuw inloggen met {provider}

source: Sign up using {provider}
nl: Registreer met {provider}

source: Sorry, changing your email address is not possible because an account with this email address already exists.
nl: Sorry, het wijzigen van je e-mailadres is niet mogelijk omdat er al een account bestaat met dit e-mailadres.

source: Yes, I want to link this account
nl: Ja, ik wil dit account koppelen

source: Yes, I want to unlink this account
nl: Ja, ik wil dit account ontkoppelen

source: You cannot unlink your only way to sign in.
nl: Je kunt je enige manier om in te loggen niet ontkoppelen.

source: OpenID connection
nl: OpenID-koppeling

source: OpenID connections
nl: OpenID-koppelingen

source: Unknown provider: {provider_key}
nl: Onbekende dienst: {provider_key}

source: last usage of this connection
nl: laatste gebruik van deze koppeling

source: An unexpected error occurred during authentication. Please try again.
nl: Onverwachte fout tijdens authenticatie. Probeer het opnieuw.

source: Expired or invalid token. Please try again.
nl: Verlopen of ongeldig token. Probeer het opnieuw.

source: Link with {provider}
nl: Koppel met {provider}

source: Login failed. Invalid credentials.
nl: Inloggen mislukt. Ongeldige inloggegevens.

source: Registration is disabled.
nl: Registratie is uitgeschakeld.

source: Sign in with {provider}
nl: Log in met {provider}

source: The authentication request has expired. Please try again.
nl: Het authenticatieverzoek is verlopen. Probeer het opnieuw.

source: Unlink from {provider}
nl: Ontkoppelen van {provider}

source: You already have an account with this email address. Please sign in to link your account.
nl: Je hebt al een account met dit e-mailadres. Log in om je account te koppelen.

# OTP device name
source: Recovery codes
nl: Herstelcodes

source: Enter a recovery code
nl: Gebruik een herstelcode

source: Enter the code from the app
nl: Voer de code van de app in

source: I have stored my backup codes in a safe place
nl: Ik heb mijn herstelcodes op een veilige plek opgeslagen

source: Invalid token. Please make sure you have entered it correctly.
nl: Ongeldig token. Controleer of je het correct hebt ingevoerd.

source: You can use these codes to log in if you lose access to your device
nl: Je kunt deze codes gebruiken om in te loggen als je geen toegang meer hebt tot je apparaat

source: Set up two-factor authentication
nl: Tweefactor­authenticatie instellen

source: Excessive login attempts have been detected for this account. For your safety, additional security measures are now in place.
nl: Er zijn te veel inlogpogingen gedetecteerd voor dit account. Voor jouw veiligheid zijn er nu extra beveiligingsmaatregelen ingeschakeld.

source: Forgot your password?
nl: Wachtwoord vergeten?

source: No account yet?
nl: Nog geen account?

source: Sign in
nl: Inloggen

source: Sign up
nl: Registreren

source: With a trusted service
nl: Met een vertrouwde dienst

source: With your email and password
nl: Met je e-mailadres en wachtwoord

source: Cancel
nl: Annuleren

source: Logout
nl: Uitloggen

source: Logout requested by %(application)s
nl: Uitloggen aangevraagd door %(application)s

source: Sign out
nl: Uitloggen

source: Edit account
nl: Account bewerken

source: Edit your account information
nl: Bewerk je accountinformatie

source: Save
nl: Opslaan

source: Back
nl: Terug

source: Your account has been successfully updated.
nl: Je account is succesvol bijgewerkt.

source: If you did not make this request, you can cancel it using the following link:
nl: Als je deze wijziging niet hebt aangevraagd, kun je het met de volgende link annuleren:

source: To confirm this change, use the following link:
nl: Gebruik de volgende link om deze wijziging te bevestigen:

source: You requested to change your account email address from %(current_email)s to %(proposed_email)s.
nl: Je wilt het e-mailadres van je account wijzigen van %(current_email)s naar %(proposed_email)s.

source: Confirm your email change request
nl: Bevestig je verzoek om je e-mailadres te wijzigen

source: Please remember to use %(proposed_email)s to sign in from now on. No further action is required.
nl: Vergeet niet om vanaf nu %(proposed_email)s te gebruiken om in te loggen. Er is verder geen actie vereist.

source: Your account email address has been changed from %(current_email)s to %(proposed_email)s.
nl: Het e-mailadres van je account is gewijzigd van %(current_email)s naar %(proposed_email)s.

source: Your account email address has been changed
nl: Het e-mailadres van je account is gewijzigd

source: If you did not change your password, please reset your password immediately using the following link:
nl: Als je je wachtwoord niet hebt gewijzigd, stel dan onmiddellijk een nieuw wachtwoord in met de volgende link:

source: Your password has been changed.
nl: Je wachtwoord is gewijzigd.

source: Your password has been changed
nl: Je wachtwoord is gewijzigd

source: Please change the email address of the other account first, then try again.
nl: Wijzig eerst het e-mailadres van het andere account en probeer het dan opnieuw.

source: You requested to change your account email address from %(current_email)s to %(proposed_email)s. However, you already have an account that uses %(proposed_email)s.
nl: Je wilt het e-mailadres van je account wijzigen van %(current_email)s naar %(proposed_email)s. Je hebt echter al een account met %(proposed_email)s.

source: Email change request
nl: E-mailadres wijziging

source: Are you sure you want to cancel the request to change your account email address from %(current_email)s to %(proposed_email)s?
nl: Weet je zeker dat je het verzoek om het e-mailadres van je account van %(current_email)s naar %(proposed_email)s te wijzigen wilt annuleren?

source: Cancel email change request
nl: Annuleer verzoek om e-mailadres te wijzigen

source: The request to change your account email address has been successfully canceled.
nl: Het verzoek om het e-mailadres van je account te wijzigen is succesvol geannuleerd.

source: Change email address
nl: Wijzig e-mailadres

source: Please also confirm the change from your current email address.
nl: Bevestig ook de wijziging vanaf je huidige e-mailadres.

source: Please also confirm the change from your new email address.
nl: Bevestig ook de wijziging vanaf je nieuwe e-mailadres.

source: Please remember to use your new email address to sign in from now on.
nl: Vergeet niet om vanaf nu je nieuwe e-mailadres te gebruiken om in te loggen.

source: Something went wrong
nl: Er ging iets fout

source: You have confirmed the change from both your current and new email addresses.
nl: Je hebt de wijziging bevestigd vanaf zowel je huidige als je nieuwe e-mailadres.

source: You have confirmed the change from your current email address.
nl: Je hebt de wijziging bevestigd vanaf je huidige e-mailadres.

source: You have confirmed the change from your new email address.
nl: Je hebt de wijziging bevestigd vanaf je nieuwe e-mailadres.

source: Your account email address has been changed successfully.
nl: Het e-mailadres van je account is succesvol gewijzigd.

source: Are you sure you want to change your account email address from %(current_email)s to %(proposed_email)s?
nl: Weet je zeker dat je het e-mailadres van je account wilt wijzigen van %(current_email)s naar %(proposed_email)s?

source: Confirm
nl: Bevestig

source: Confirm email change
nl: Bevestig e-mailadres wijziging

source: Enter the email address you would like to use for your account.
nl: Voer het e-mailadres in dat je voor je account wilt gebruiken.

source: Set a password
nl: Wachtwoord instellen

source: To change your account email address, please set a password first.
nl: Stel eerst een wachtwoord in om het e-mailadres van je account te kunnen wijzigen.

source: You will receive an email on both your current and the new email address with a link to confirm this change.
nl: Je ontvangt een e-mail op zowel je huidige als het nieuwe e-mailadres met een link om de wijziging te bevestigen.

source: Your account does not currently have a password set.
nl: Er is momenteel geen wachtwoord ingesteld voor je account.

source: Changing your account email address requires confirmation from both your current and new email addresses. Please check your email for a confirmation link.
nl: Om het e-mailadres van je account te wijzigen moet je bevestigen vanaf zowel je huidige als het nieuwe e-mailadres. Check je e-mail voor een bevestigingslink.

source: It may take a few minutes for this email to arrive. If you do not see it, check your spam folder. If you still cannot find it, make sure you entered the correct email address.
nl: Het kan een paar minuten duren voordat deze e-mail aankomt. Als je de e-mail niet ziet, controleer dan je spam folder. Als je de e-mail nog steeds niet kunt vinden, controleer dan of je het juiste e-mailadres hebt ingevoerd.

source: Your account email address will only be changed after you confirm from both email addresses.
nl: Het e-mailadres van je account wordt pas gewijzigd nadat je vanaf beide e-mailadressen hebt bevestigd.

source: Manage account
nl: Account beheren

source: Manage your account information
nl: Beheer je accountinformatie

source: You are currently logged in as %(user)s.
nl: Je bent momenteel ingelogd als %(user)s.

source: Change password
nl: Wachtwoord wijzigen

source: Add a password to your account. This will allow you to sign in using your email address and password as well as any linked services.
nl: Stel een wachtwoord in voor je account. Hiermee kun je inloggen met je e-mailadres en wachtwoord, evenals met eventuele gekoppelde diensten.

source: For your security, you need to re-authenticate via a linked service before you can set a password.
nl: Voor je veiligheid moet je opnieuw inloggen via een gekoppelde dienst voordat je een wachtwoord kunt instellen.

source: However, your account is not currently linked to any service, so you cannot set a password at this time.
nl: Er is echter geen enkele dienst aan je account gekoppeld, waardoor je op dit moment geen wachtwoord kunt instellen.

source: Linked services
nl: Gekoppelde diensten

source: Your password has been set.
nl: Je wachtwoord is ingesteld.

source: Use the following link to reset your password:
nl: Gebruik de volgende link om een wachtwoord opnieuw in te stellen:

source: Reset your password
nl: Je wachtwoord opnieuw instellen

source: However, your account does not currently have a password set.
nl: Je account heeft alleen nog geen wachtwoord.

source: Use the following link to set a password:
nl: Gebruik de volgende link om een wachtwoord in te stellen:

source: You requested a link to reset your password.
nl: Je hebt een link aangevraagd om je wachtwoord opnieuw in te stellen.

source: Please enter your new password twice to ensure you typed it correctly.
nl: Voer je nieuwe wachtwoord twee keer in om er zeker van te zijn dat je het correct hebt ingevoerd.

source: Reset password
nl: Wachtwoord opnieuw instellen

source: Your password has been set. You can now sign in using your new password.
nl: Je wachtwoord is ingesteld. Je kunt nu inloggen met je nieuwe wachtwoord.

source: Please check your email for a link to reset your password.
nl: Check je e-mail voor een link om je wachtwoord opnieuw in te stellen.

source: Continue
nl: Verder

source: Forgotten your password? Enter your email address to receive a link to reset your password.
nl: Wachtwoord vergeten? Voer je e-mailadres om een link te ontvangen waarmee je je wachtwoord opnieuw kunt instellen.

source: Already have an account?
nl: Heb je al een account?

source: Alternatively, you can <a href="%(next)s">continue using your current account</a>.
nl: Je kunt ook <a href="%(next)s">doorgaan met je huidige account</a>.

source: Create a new account
nl: Maak een nieuw account

source: Sign up using a trusted service
nl: Registreren met een vertrouwde dienst

source: To create a new account, please sign out first.
nl: Om een nieuw account aan te maken moet je eerst uitloggen.

source: Terms of Service
nl: Servicevoorwaarden

source: If you did not attempt to sign up, you can safely ignore this email.
nl: Als je je niet geprobeerd hebt te registeren, kun je deze e-mail gewoon negeren.

source: You're receiving this email because you attempted to create an account using this email address. However, an account already exists with this email address. If you have forgotten your password, you can reset it using this link:
nl: Je ontvangt deze e-mail omdat je geprobeerd hebt een account aan te maken met dit e-mailadres. Er bestaat echter al een account met dit e-mailadres. Als je je wachtwoord bent vergeten, kun je deze resetten met de volgende link:

source: Sign up request
nl: Registratie verzoek

source: You're receiving this email because you created an account with this email address. Please go to the following page and verify your email address:
nl: Je ontvangt deze e-mail omdat je een account hebt aangemaakt met dit e-mailadres. Ga naar de volgende pagina en verifieer je e-mailadres:

source: Verify your email address
nl: Verifieer je e-mailadres

source: Verification completed
nl: Verificatie voltooid

source: You can now <a href="%(login_url)s">sign in</a>.
nl: Je kunt nu <a href="%(login_url)s">inloggen</a>.

source: Your email address is now verified.
nl: Je e-mailadres is nu geverifieerd.

source: Resend verification email
nl: Verificatie-e-mail opnieuw verzenden

source: Verification required
nl: Verificatie vereist

source: You need to verify your email address before you can sign in. Please check your email for a verification link.
nl: Je moet je e-mailadres verifiëren voordat je kunt inloggen. Check je e-mail voor een verificatielink.

source: To continue, please fill in your first and last name before verifying your email.
nl: Vul je voor- en achternaam in voordat je je e-mailadres verifieert.

source: To continue, please verify your email.
nl: Verifieer je e-mailadres om verder te gaan.

source: Verify email
nl: E-mailadres verifiëren

source: Invalid link
nl: Ongeldige link

source: The link you followed is invalid. It may have expired or been used already.
nl: De link die je hebt gevolgd is ongeldig. Het kan zijn dat deze is verlopen of al is gebruikt.

source: Are you sure you want to do this?
nl: Weet je zeker dat je dit wilt doen?

source: Link account
nl: Account koppelen

source: This will allow you to use your %(provider)s account (%(provider_email)s) to sign in to your existing account (%(user_email)s).
nl: Dit stelt je in staat om je %(provider)s-account (%(provider_email)s) te gebruiken om in te loggen op je bestaande account (%(user_email)s).

source: This will allow you to use your %(provider)s account to sign in to your existing account.
nl: Dit stelt je in staat om je %(provider)s-account te gebruiken om in te loggen op je bestaande account.

source: You are about to link your %(provider)s account to your existing account.
nl: Je staat op het punt je %(provider)s-account te koppelen aan je bestaande account.

source: Manage linked trusted services
nl: Beheer gekoppelde vertrouwde diensten

source: Manage your linked trusted services
nl: Beheer jouw gekoppelde vertrouwde diensten

source: Successfully linked your %(provider)s account.
nl: Je %(provider)s-account is nu gekoppeld.

source: After unlinking, you will no longer be able to use your %(provider)s account to sign in.
nl: Na het ontkoppelen kun je niet meer met je %(provider)s-account inloggen.

source: Unlink account
nl: Account ontkoppelen

source: You are about to unlink your %(provider)s account from your account.
nl: Je staat op het punt je %(provider)s-account te ontkoppelen.

source: Successfully unlinked your %(provider)s account.
nl: Je %(provider)s-account is nu ontkoppeld.

source: Available services
nl: Beschikbare diensten

source: To unlink this service, you must <a href="%(set_password_url)s">set a password</a> for your account.
nl: Om deze dienst te ontkoppelen, moet je <a href="%(set_password_url)s">een wachtwoord instellen</a> voor je account.

source: To unlink this service, you must either link another service or <a href="%(set_password_url)s">set a password</a> for your account.
nl: Om deze dienst te ontkoppelen, moet je een andere dienst koppelen of <a href="%(set_password_url)s">een wachtwoord instellen</a> voor je account.

source: Unlinking is currently disabled to prevent you from being locked out.
nl: Ontkoppelen is momenteel uitgeschakeld om te voorkomen dat je wordt buitengesloten.

source: Your account is currently linked with the following service:
nl: Je account is momenteel aan de volgende dienst gekoppeld:

source: Cancel and return to login
nl: Annuleren en terug naar inloggen

source: Disable two-factor authentication
nl: Tweefactor­authenticatie uitschakelen

source: Disabling two-factor authentication will make your account less secure.
nl: Het uitschakelen van tweefactor­authenticatie maakt je account minder veilig.

source: If you have lost your device, you can <a href="%(recovery_code_url)s">use a recovery code</a> instead.
nl: Als je je apparaat bent kwijtgeraakt, kun je in plaats daarvan <a href="%(recovery_code_url)s">een herstelcode gebruiken</a>.

source: Two-factor authentication
nl: Tweefactor­authenticatie

source: Warning
nl: Waarschuwing

source: You've successfully configured two-factor authentication. Please make sure you have stored your recovery codes in a safe place. You can use these codes to access your account if you lose access to your device. You can view your recovery codes by visiting the two-factor authentication settings page:
nl: Je hebt tweefactor­authenticatie succesvol geconfigureerd. Zorg ervoor dat je je herstelcodes op een veilige plek hebt opgeslagen. Je kunt deze codes gebruiken om toegang te krijgen tot je account als je geen toegang meer hebt tot je apparaat. Je kunt je herstelcodes bekijken door de tweefactor­authenticatie-instellingenpagina te bezoeken:

source: Please make sure you have stored your recovery codes in a safe place. You can use these codes to access your account if you lose access to your device. You can view your recovery codes by visiting the two-factor authentication settings page:
nl: Zorg ervoor dat je je herstelcodes op een veilige plek hebt opgeslagen. Je kunt deze codes gebruiken om toegang te krijgen tot je account als je geen toegang meer hebt tot je apparaat. Je kunt je herstelcodes bekijken door de tweefactor­authenticatie-instellingenpagina te bezoeken:

source: You've successfully configured two-factor authentication.
nl: Je hebt tweefactor­authenticatie succesvol geconfigureerd.

source: Two-factor authentication configured
nl: Tweefactor­authenticatie is geconfigureerd

source: Your two-factor-authentication configuration on your account has been removed. Your recovery codes have been invalidated, and you will need to generate new ones if you wish to use two-factor-authentication again. You can re-enable two-factor-authentication by visiting the two-factor authentication settings page:
nl: Je tweefactor­authenticatie-configuratie op je account is verwijderd. Je herstelcodes zijn ongeldig gemaakt en je moet nieuwe genereren als je tweefactor­authenticatie opnieuw wilt gebruiken. Je kunt tweefactor­authenticatie opnieuw inschakelen door de tweefactor­authenticatie-instellingenpagina te bezoeken:

source: Two-factor authentication disabled
nl: Tweefactor­authenticatie uitgeschakeld

source: A recovery code was used to log in to your account. If you did not attempt to log in, please reset your password immediately.
nl: Een herstelcode is gebruikt om in te loggen op je account. Als je niet hebt geprobeerd in te loggen, stel dan onmiddellijk je wachtwoord opnieuw in.

source: You can generate new recovery codes by visiting the two-factor authentication settings page:
nl: Je kunt nieuwe herstelcodes genereren door de tweefactor­authenticatie-instellingenpagina te bezoeken:

source: You have %(tokens)s recovery code left.
nl: Je hebt nog %(tokens)s herstelcode.

source: Recovery code used
nl: Herstelcode gebruikt

source: Recovery codes have been regenerated for your account.
nl: Herstelcodes zijn opnieuw gegenereerd voor je account.

source: Recovery codes were regenerated
nl: Herstelcode zijn opnieuw gegenereerd

source: Recovery codes
nl: Herstelcodes

source: Two-factor methods
nl: Tweefactormethoden

source: configured
nl: geconfigureerd

source: disable
nl: uitschakelen

source: not configured
nl: niet geconfigureerd

source: set up
nl: instellen

source: view
nl: bekijken

source: Generate new codes
nl: Genereer nieuwe codes
